Repository: codacy-open-source-projects-scans/flex
Catalog: po/*.po
Languages: ro

source: Allocation of buffer to print string failed
ro: Alocarea tamponului(buffer) pentru șirul de imprimare a eșuat

source: State #%d is non-accepting -
ro: Starea #%d este de neacceptat -

source: dangerous trailing context
ro: context ulterior(trailing) periculos

source: associated rule line numbers:
ro: numerele de linie asociate regulii:

source: out-transitions:
ro: tranziții de ieșire:

source: jam-transitions: EOF
ro: tranziții blocate: sfârșit de fișier(EOF)

source: consistency check failed in epsclosure()
ro: verificare de consistență eșuată în epsclosure()

source: DFA Dump:
ro: Rezultat(dump) DFA:

source: could not create unique end-of-buffer state
ro: nu s-a putut crea starea unică de sfârșit de tampon(buffer)

source: state # %d:
ro: stare # %d:

source: Could not write yynxt_tbl[][]
ro: Nu s-a putut scrie yynxt_tbl[][]

source: bad transition character detected in sympartition()
ro: caracter greșit de tranziție detectat în sympartition()

source: Equivalence Classes:
ro: Clase de echivalență:

source: state # %d accepts: [%d]
ro: starea # %d acceptă: [%d]

source: state # %d accepts:
ro: starea # %d acceptă:

source: Could not write yyacclist_tbl
ro: Nu s-a putut scrie yyacclist_tbl

source: Could not write yyacc_tbl
ro: Nu s-a putut scrie yyacc_tbl

source: Could not write ecstbl
ro: Nu s-a putut scrie ecstbl

source: Meta-Equivalence Classes:
ro: Clase de meta-echivalență:

source: Could not write yymeta_tbl
ro: Nu s-a putut scrie yymeta_tbl

source: Could not write yybase_tbl
ro: Nu s-a putut scrie yybase_tbl

source: Could not write yydef_tbl
ro: Nu s-a putut scrie yydef_tbl

source: Could not write yynxt_tbl
ro: Nu s-a putut scrie yynxt_tbl

source: Could not write yychk_tbl
ro: Nu s-a putut scrie yychk_tbl

source: Could not write ftbl
ro: Nu s-a putut scrie ftbl

source: Could not write ssltbl
ro: Nu s-a putut scrie ssltbl

source: Could not write eoltbl
ro: Nu s-a putut scrie eoltbl

source: Could not write yynultrans_tbl
ro: Nu s-a putut scrie yynultrans_tbl

source: rule cannot be matched
ro: regula nu se potrivește cu nimic

source: -s option given but default rule can be matched
ro: a fost dată opțiunea -s dar regula implicită se poate potrivi

source: Can't use -+ with -l option
ro: Nu se poate folosi -+ cu opțiunea -l

source: Can't use -f or -F with -l option
ro: Nu se poate folosi -f sau -F cu opțiunea -l

source: -Cf/-CF and -Cm don't make sense together
ro: -Cf/-CF şi -Cm nu au sens folosite împreună

source: -Cf/-CF and -I are incompatible
ro: -Cf/-CF şi -I sunt incompatibile

source: -Cf/-CF are incompatible with lex-compatibility mode
ro: -Cf/-CF sunt incompatibile cu modul de compatibilitate lex

source: -Cf and -CF are mutually exclusive
ro: -Cf şi -CF se exclud reciproc

source: Can't use -+ with -CF option
ro: Nu se poate folosi -+ cu opțiunea -CF

source: %array incompatible with -+ option
ro: %array incompatibil cu opțiunea „-+”

source: Options -+ and --reentrant are mutually exclusive.
ro: Opțiunile -+ and --reentrant se exclud reciproc.

source: bison bridge not supported for the C++ scanner.
ro: bridge bison nu este suportat pentru scanerul C++.

source: could not create %s
ro: nu s-a putut crea %s

source: %option yyclass only meaningful for C++ scanners
ro: %opțiunea yyclass are sens doar pentru scanerele C++

source: input error reading skeleton file %s
ro: eroare de intrare la citirea fișierului schelet %s

source: error closing skeleton file %s
ro: eroare la închiderea fișierului schelet %s

source: error writing output file %s
ro: eroare la scrierea fișierului de ieșire %s

source: error closing output file %s
ro: eroare la închiderea fișierului de ieșire %s

source: error deleting output file %s
ro: eroare la ștergerea fișierului de ieșire %s

source: No backing up.
ro: Fără copie de rezervă.

source: %d backing up (non-accepting) states.
ro: %d copii de rezervă de (inacceptabile) stări.

source: Compressed tables always back up.
ro: Tabelele comprimate întotdeauna au copie de rezervă.

source: error writing backup file %s
ro: eroare la scrierea fișierului de copie de rezervă %s

source: error closing backup file %s
ro: eroare la închiderea fișierului de rezervă %s

source: %s version %s usage statistics:
ro: %s versiunea %s statistici de folosire:

source: scanner options: -
ro: opțiuni de scaner: -

source: %d/%d NFA states
ro: %d/%d stări NFA

source: %d/%d DFA states (%d words)
ro: %d/%d stări DFA (%d cuvinte)

source: %d rules
ro: %d reguli

source: No backing up
ro: Nu se face copia de rezervă

source: %d backing-up (non-accepting) states
ro: %d copiere de rezervă de (inacceptabile) stări

source: Compressed tables always back-up
ro: Tabelele comprimate întotdeauna au copie de rezervă

source: Beginning-of-line patterns used
ro: Tipare de început de linie folosite

source: %d/%d start conditions
ro: %d/%d condiții de start

source: %d epsilon states, %d double epsilon states
ro: %d stări epsilon, %d stări dublu epsilon

source: no character classes
ro: nici o clasă de caractere

source: %d/%d character classes needed %d/%d words of storage, %d reused
ro: %d/%d clase de caractere necesare %d/%d cuvinte de stocare, %d refolosite

source: %d state/nextstate pairs created
ro: %d perechi de stare/stare_următoare create

source: %d/%d unique/duplicate transitions
ro: %d/%d tranziții unice/duplicate

source: %d table entries
ro: %d intrări în tabele

source: %d/%d base-def entries created
ro: %d/%d intrări base-def create

source: %d/%d (peak %d) nxt-chk entries created
ro: %d/%d (maxim %d) intrări nxt-chk create

source: %d/%d (peak %d) template nxt-chk entries created
ro: %d/%d (maxim %d) intrări de model nxt-chk create

source: %d empty table entries
ro: %d intrări în tabel goale

source: %d protos created
ro: %d prototipuri create

source: %d templates created, %d uses
ro: %d tipare create, %d utilizate

source: %d/%d equivalence classes created
ro: %d/%d clase de echivalență create

source: %d/%d meta-equivalence classes created
ro: %d/%d clase de meta-echivalență create

source: %d (%d saved) hash collisions, %d DFAs equal
ro: %d (%d salvate) coliziuni de localizare(hash), %d DFA-uri sunt egale

source: %d sets of reallocations needed
ro: %d seturi de realocări necesare

source: %d total table entries needed
ro: sunt necesare %d intrări în tabel, în total

source: Internal error. flexopts are malformed.
ro: Eroare internă. Opțiunile flex(flexopts) sunt compuse greșit.

source: Try `%s --help' for more information.
ro: Încercați «%s --help» pentru mai multe informații.

source: unknown -C option '%c'
ro: opțiune -C necunoscută „%c”

source: fatal parse error
ro: eroare fatală de analizare(parse)

source: could not write tables header
ro: nu s-a putut scrie antetul tabelelor

source: can't open skeleton file %s
ro: nu s-a putut deschide fișierul schelet %s

source: Prefix cannot include '[' or ']'
ro: Prefixul nu poate include „[” sau „]”

source: could not create backing-up info file %s
ro: nu s-a putut crea fișierul de informații pentru regulile care cauzează o retragere a(un recul al) analizatorului %s

source: -l AT&T lex compatibility option entails a large performance penalty
ro: -l opțiunea de compatibilitate AT&T lex determină o scădere drastică a performanței

source: and may be the actual source of other reported performance penalties
ro: și poate fi sursa reală a altor scăderi de performanță raportate

source: %%option yylineno entails a performance penalty ONLY on rules that can match newline characters
ro: %%opțiunea yylineno determină o scădere drastică a performanței DOAR în regulile care se potrivesc caracterelor linie_nouă

source: -I (interactive) entails a minor performance penalty
ro: -I (interactiv) determină o scădere minoră a performanței

source: yymore() entails a minor performance penalty
ro: yymore() determină o scădere minoră a performanței

source: REJECT entails a large performance penalty
ro: REJECT determină o scădere drastică a performanței

source: Variable trailing context rules entail a large performance penalty
ro: Variabilele care urmează regulile de context, determină o scădere drastică a performanței

source: REJECT cannot be used with -f or -F
ro: REJECT nu poate fi folosit cu -f sau -F

source: %option yylineno cannot be used with REJECT
ro: %opțiunea yylineno nu poate fi folosită cu REJECT

source: variable trailing context rules cannot be used with -f or -F
ro: variabilele care urmează regulile de context, nu pot fi folosite cu -f sau -F

source: allocation of macro definition failed
ro: a eșuat alocarea definiției de macro

source: Usage: %s [OPTIONS] [FILE]...
ro: Utilizare: %s [OPȚIUNI] [FIŞIER]...

source: memory allocation failed in allocate_array()
ro: eroare de alocare a memoriei în allocate_array()

source: bad character '%s' detected in check_char()
ro: caracter greșit „%s” detectat în check_char()

source: scanner requires -8 flag to use the character %s
ro: scanerul necesită parametrul(flag) -8 pentru a folosi caracterul %s

source: memory allocation failure in xstrdup()
ro: eroare de alocare a memoriei în xstrdup()

source: %s: fatal internal error, %s
ro: %s: eroare internă fatală, %s

source: attempt to increase array size failed
ro: încercarea de a mări dimensiunea matricei a eșuat

source: memory allocation failed in yy_flex_xmalloc()
ro: eroare de alocare a memoriei în yy_flex_xmalloc()

source: ********** beginning dump of nfa with start state %d
ro: ********** se pornește aducerea(dump) nfa, cu starea inițială %d

source: state # %4d
ro: stare # %4d

source: ********** end of dump
ro: ********** sfârșit de aducere(dump)

source: empty machine in dupmachine()
ro: mașină goală în dupmachine()

source: Variable trailing context rule at line %d
ro: Regulă variabilă de final de context pe linia %d

source: bad state type in mark_beginning_as_normal()
ro: tip de stare defectuoasă în mark_beginning_as_normal()

source: input rules are too complicated (>= %d NFA states)
ro: regulile de intrare sunt prea complicate (>= %d stări NFA)

source: found too many transitions in mkxtion()
ro: s-au găsit prea multe tranziții în mkxtion()

source: too many rules (> %d)!
ro: prea multe reguli (> %d)!

source: unknown error processing section 1
ro: eroare necunoscută la procesarea secțiunii 1

source: bad start condition list
ro: listă de condiții inițiale greșite

source: Prefix must not contain [ or ]
ro: Prefixul nu trebuie să conțină „[” sau „]”

source: unrecognized rule
ro: regulă nerecunoscută

source: trailing context used twice
ro: context de urmărit(trailing), utilizat de două ori

source: bad iteration values
ro: valori de iterație greşite

source: iteration value must be positive
ro: valoarea iterației trebuie să fie pozitivă

source: the character range [%c-%c] is ambiguous in a case-insensitive scanner
ro: intervalul de caracter [%c %c] este ambiguu într-un scaner ce nu face diferența între majusculele și minuscule

source: negative range in character class
ro: interval negativ în clasa de caractere

source: [:^lower:] is ambiguous in case insensitive scanner
ro: [:^lower:] este ambiguu în cazul scanerului ce nu face diferența între majusculele și minuscule

source: [:^upper:] ambiguous in case insensitive scanner
ro: [:^upper:] este ambiguu în cazul scanerului ce nu face diferența între majusculele și minuscule

source: Input line too long
ro: Linie de intrare prea lungă

source: malformed '%top' directive
ro: directivă „%top” compusă greșit

source: unrecognized '%' directive
ro: directivă „%” nerecunoscută

source: Definition name too long
ro: Numele definiției este prea lung

source: Unmatched '{'
ro: „{” fără corespondent

source: Definition value for {%s} too long
ro: Valoarea definiției pentru {%s} este prea lungă

source: incomplete name definition
ro: definiție incompletă a numelui

source: Option line too long
ro: Linia de opțiuni este prea lungă

source: unrecognized %%option: %s
ro: %%opțiune nerecunoscută: %s

source: bad character class
ro: clasă de caractere greşită

source: undefined definition {%s}
ro: definiție nedefinită {%s}

source: unbalanced parenthesis
ro: paranteză dezechilibrată(fără pereche)

source: bad <start condition>: %s
ro: <condiție de start> greșită: %s

source: missing quote
ro: ghilimele lipsesc

source: bad character class expression: %s
ro: expresie clasă caracter greșită: %s

source: bad character inside {}'s
ro: caracter eronat între {}

source: missing }
ro: lipsește }

source: EOF encountered inside an action
ro: sfârșit de fișier(EOF) întâlnit în mijlocul acțiunii

source: EOF encountered inside pattern
ro: sfârșit de fișier(EOF) întâlnit în mijlocul tiparului

source: bad character: %s
ro: caracter eronat: %s

source: can't open %s
ro: nu se poate deschide %s

source: Usage: %s [OPTIONS]...
ro: Utilizare: %s [OPȚIUNI]...

source: option `%s' doesn't allow an argument
ro: opțiunea „%s” nu permite parametri

source: option `%s' requires an argument
ro: opțiunea „%s” necesită un parametru

source: option `%s' is ambiguous
ro: opțiunea „%s” este ambiguă

source: Unrecognized option `%s'
ro: Opțiune necunoscută „%s”

source: Unknown error=(%d)
ro: Eroare necunoscută=(%d)

source: symbol table memory allocation failed
ro: alocarea de memorie pentru tabela de simboluri a eșuat

source: name defined twice
ro: nume definit de două ori

source: start condition %s declared twice
ro: condiție de start %s declarată de două ori

source: premature EOF
ro: sfârșit de fișier(EOF) prematur

source: End Marker
ro: Marcaj de sfârșit

source: *Something Weird* - tok: %d val: %d
ro: *Ceva Ciudat* - terminal: %d val: %d
